Documents/Назначение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>Назначение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РегистрНакопления1</xr:Item>
				<xr:Item>AccumulationRegister.РегистрНаставники</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профессия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Профессии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Стажер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Стажеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наставник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Наставники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РегистрНаставники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>РегистрНаставники</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прикреплен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Стажер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стажеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Наставник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Наставники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Наставники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Наставники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Пол</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профессия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Профессии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпераментПоТесту</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТемперамента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяДолжность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/Назначение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура назначитьнаставников(Команда)
	Если НЕ(Объект.Профессия.Пустая()) Тогда
		ВыполнениеЗапроса();
	Иначе
		Сообщить("Выберите профессию назначения");
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ВыполнениеЗапроса()
	Запрос = Новый Запрос;
	Если Объект.Должность.Наименование = "" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Наставник КАК Наставник,
		               |	ВложенныйЗапрос.Наставник.Профессия КАК Профессия,
		               |	ВложенныйЗапрос.ПрикрепленОстаток КАК ПрикрепленОстаток,
		               |	ВложенныйЗапрос.ПриоритетДолжности КАК ПриоритетДолжности,
		               |	ВложенныйЗапрос.ТекущаяДолжность КАК ТекущаяДолжность
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		Наставники.Ссылка КАК Наставник,
		               |		ЕСТЬNULL(РегистрНаставникиОстатки.ПрикрепленОстаток, 0) КАК ПрикрепленОстаток,
		               |		Должности.Приоритет КАК ПриоритетДолжности,
		               |		Наставники.ТекущаяДолжность КАК ТекущаяДолжность
		               |	ИЗ
		               |		Справочник.Наставники КАК Наставники
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНаставники.Остатки(&Период, ) КАК РегистрНаставникиОстатки
		               |			ПО Наставники.Ссылка = РегистрНаставникиОстатки.Наставник
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
		               |			ПО Наставники.ТекущаяДолжность = Должности.Ссылка) КАК ВложенныйЗапрос
		               |ГДЕ
		               |	ВложенныйЗапрос.ПрикрепленОстаток = 0
		               |	И ВложенныйЗапрос.Наставник.Профессия = &Профессия
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Профессия,
		               |	ТекущаяДолжность,
		               |	ПриоритетДолжности УБЫВ";
		Запрос.УстановитьПараметр("Период", Объект.Дата);
		Запрос.УстановитьПараметр("Профессия", Объект.Профессия);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВложенныйЗапрос.Наставник КАК Наставник,
		               |	ВложенныйЗапрос.Наставник.Профессия КАК Профессия,
		               |	ВложенныйЗапрос.ПрикрепленОстаток КАК ПрикрепленОстаток,
		               |	ВложенныйЗапрос.ПриоритетДолжности КАК ПриоритетДолжности,
		               |	ВложенныйЗапрос.ТекущаяДолжность КАК ТекущаяДолжность
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		Наставники.Ссылка КАК Наставник,
		               |		ЕСТЬNULL(РегистрНаставникиОстатки.ПрикрепленОстаток, 0) КАК ПрикрепленОстаток,
		               |		Должности.Приоритет КАК ПриоритетДолжности,
		               |		Наставники.ТекущаяДолжность КАК ТекущаяДолжность
		               |	ИЗ
		               |		Справочник.Наставники КАК Наставники
		               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНаставники.Остатки(&Период, ) КАК РегистрНаставникиОстатки
		               |			ПО Наставники.Ссылка = РегистрНаставникиОстатки.Наставник
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должности КАК Должности
		               |			ПО Наставники.ТекущаяДолжность = Должности.Ссылка) КАК ВложенныйЗапрос
		               |ГДЕ
		               |	ВложенныйЗапрос.ПрикрепленОстаток = 0
					   | 	И ВложенныйЗапрос.ТекущаяДолжность = &Должность
		               |	И ВложенныйЗапрос.Наставник.Профессия = &Профессия
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Профессия,
		               |	ТекущаяДолжность,
		               |	ПриоритетДолжности УБЫВ";
		Запрос.УстановитьПараметр("Период", Объект.Дата);
		Запрос.УстановитьПараметр("Должность", Объект.Должность);
		Запрос.УстановитьПараметр("Профессия", Объект.Профессия);	
	КонецЕсли;	
		
	Запрос = Запрос.Выполнить().Выгрузить();
	
	СтрокаЗапроса = 0;
	Для Каждого СтрокаТЧ из Объект.ТабличнаяЧасть1 Цикл
		Попытка
			СтрокаТЧ.Наставник = Запрос[СтрокаЗапроса].Наставник;
			СтрокаЗапроса = СтрокаЗапроса + 1;
		Исключение
		 	Сообщить("Больше нет наставников по такой профессии");
			Прервать;
		КонецПопытки;
	КонецЦикла;
КонецФункции
